<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Proyecto de Grado</title>
<style type="text/css">
<!--
.Estilo2 {	font-size: 36px;
	color: #FF0000;
}
.Estilo8 {
	font-family: Arial, Helvetica, sans-serif;
	font-size: 24px;
}
.Estilo10 {
	font-size: 36px;
	font-family: Georgia, "Times New Roman", Times, serif;
	font-weight: bold;
}
.Estilo14 {font-family: Arial, Helvetica, sans-serif; font-size: 36px; font-weight: bold; }
-->
</style>
<script type="text/JavaScript">
<!--
function MM_swapImgRestore() { //v3.0
  var i,x,a=document.MM_sr; for(i=0;a&&i<a.length&&(x=a[i])&&x.oSrc;i++) x.src=x.oSrc;
}

function MM_preloadImages() { //v3.0
  var d=document; if(d.images){ if(!d.MM_p) d.MM_p=new Array();
    var i,j=d.MM_p.length,a=MM_preloadImages.arguments; for(i=0; i<a.length; i++)
    if (a[i].indexOf("#")!=0){ d.MM_p[j]=new Image; d.MM_p[j++].src=a[i];}}
}

function MM_findObj(n, d) { //v4.01
  var p,i,x;  if(!d) d=document; if((p=n.indexOf("?"))>0&&parent.frames.length) {
    d=parent.frames[n.substring(p+1)].document; n=n.substring(0,p);}
  if(!(x=d[n])&&d.all) x=d.all[n]; for (i=0;!x&&i<d.forms.length;i++) x=d.forms[i][n];
  for(i=0;!x&&d.layers&&i<d.layers.length;i++) x=MM_findObj(n,d.layers[i].document);
  if(!x && d.getElementById) x=d.getElementById(n); return x;
}

function MM_swapImage() { //v3.0
  var i,j=0,x,a=MM_swapImage.arguments; document.MM_sr=new Array; for(i=0;i<(a.length-2);i+=3)
   if ((x=MM_findObj(a[i]))!=null){document.MM_sr[j++]=x; if(!x.oSrc) x.oSrc=x.src; x.src=a[i+2];}
}
//-->
</script>
</head>

<body onload="MM_preloadImages('INICIO 2.png','COMPUTADORAS.png','PROCESADOR.png','SISTEMAS O.png','CONTACTOS.png')">
<table width="1368" border="1">
  <tr>
    <td width="1354" bgcolor="#FF9900"><div align="left">
      <table width="100%" border="0">
        <tr>
          <td width="28%" height="268"><img src="logo index.jpg" alt="9" width="483" height="266" /></td>
          <td width="72%"><div align="center" class="Estilo2">
            <table width="99%" border="0">
              <tr>
                <td><div align="center"><img src="BOTON INFORMATICA.png" alt="3" width="862" height="139" /></div></td>
              </tr>
              <tr>
                <td><img src="titulo index.png" alt="10" width="862" height="118" /></td>
              </tr>
            </table>
          </div></td>
        </tr>
      </table>
    </div></td>
  </tr>
  <tr>
    <td height="47"><table width="99%" border="0">
      <tr>
        <td width="17%" height="37"><a href="index.html" onmouseout="MM_swapImgRestore()" onmouseover="MM_swapImage('inicio','','INICIO 2.png',1)"><img src="BOTON INICIO.png" name="inicio" width="225" height="54" border="0" id="inicio" /></a></td>
        <td width="22%"><a href="evolucion de las computadoras.html" onmouseout="MM_swapImgRestore()" onmouseover="MM_swapImage('computadoras','','COMPUTADORAS.png',1)"><img src="BOTON COMPUTADORAS.png" name="computadoras" width="303" height="54" border="0" id="computadoras" /></a></td>
        <td width="19%"><a href="evolucion de los procesadores.html" onmouseout="MM_swapImgRestore()" onmouseover="MM_swapImage('procesador','','PROCESADOR.png',1)"><img src="BOTON PROCESADOR.png" name="procesador" width="276" height="54" border="0" id="procesador" /></a></td>
        <td width="20%"><a href="#" onmouseout="MM_swapImgRestore()" onmouseover="MM_swapImage('sistemas o','','SISTEMAS O.png',1)"><img src="BOTON SISTEMAS O.png" name="sistemas o" width="288" height="54" border="0" id="sistemas o" /></a></td>
        <td width="22%"><a href="pagina de contactos.html" onmouseout="MM_swapImgRestore()" onmouseover="MM_swapImage('contactos','','CONTACTOS.png',1)"><img src="BOTON CONTACTOS.png" name="contactos" width="250" height="54" border="0" id="contactos" /></a></td>
      </tr>
    </table></td>
  </tr>
  <tr>
    <td><table width="1358" border="0">
      <tr>
        <td height="126"><div align="center">
          <h1 class="Estilo14">Inicios de los Sistemas Operativos</h1>
          <h2 class="Estilo14">A&ntilde;os 40</h2>
          <p align="justify" class="Estilo8">A finales de los a&ntilde;os 1940, con lo que podr&iacute;amos llamar la aparici&oacute;n de la primera generaci&oacute;n de computadoras, se acced&iacute;a directamente a la consola de la computadora desde la cual se actuaba sobre una serie de micro interruptores que permit&iacute;an introducir directamente el programa en la memoria de la computadora (en realidad al existir tan pocas computadoras todos podr&iacute;an considerarse prototipos y cada constructor lo hac&iacute;a sin seguir ning&uacute;n criterio predeterminado). </p>
          </div></td>
      </tr>
      <tr>
        <td height="214"><div align="center">
          <p>&nbsp;</p>
          <p><img src="sistemas operativos a&ntilde;os 40 uno.jpg" width="500" height="350" /></p>
        </div></td>
      </tr>
      <tr>
        <td><div align="center">
          <p>&nbsp;</p>
          <p class="Estilo14">A&ntilde;os 50</p>
          <p align="justify" class="Estilo8">A principios de los a&ntilde;os 50 con el objeto de facilitar la interacci&oacute;n entre persona y computador, los sistemas operativos hacen una aparici&oacute;n discreta y bastante simple, con conceptos tales como el monitor residente, el proceso por lotes y el almacenamiento temporal.</p>
          <h3 align="justify" class="Estilo8">Monitor residente</h3>
          <p align="justify" class="Estilo8">Su funcionamiento era bastante simple, se limitaba a cargar los programas a memoria, ley&eacute;ndolos de una cinta o de tarjetas perforadas, y ejecutarlos. El problema era encontrar una forma de optimizar el tiempo entre la retirada de un trabajo y el montaje del siguiente</p>
          <h3 align="justify" class="Estilo8">Procesamiento por lotes</h3>
          <p align="justify" class="Estilo8">Como soluci&oacute;n para optimizar el tiempo de montaje surgi&oacute; la idea de agrupar los trabajos en lotes, en una misma cinta o conjunto de tarjetas, de forma que se ejecutaran uno a continuaci&oacute;n de otro sin perder apenas tiempo en la transici&oacute;n.</p>
          <h3 align="justify" class="Estilo8">Almacenamiento temporal</h3>
          <p align="justify" class="Estilo8">Su objetivo era disminuir el tiempo de carga de los programas, haciendo simult&aacute;nea la carga del programa o la salida de datos con la ejecuci&oacute;n de la siguiente tarea. Para ello se utilizaban dos t&eacute;cnicas, el buffering y el spooling. </p>
          </div></td>
      </tr>
      <tr>
        <td height="320"><div align="center">
          <p>&nbsp;</p>
          <p><img src="sistemasa operativos a&ntilde;os 50 uno.jpg" width="500" height="350" /></p>
        </div></td>
      </tr>
      <tr>
        <td height="355"><div align="center">
          <h2>&nbsp;</h2>
          <h2 class="Estilo14">A&ntilde;os 60</h2>
          <div align="justify">
            <p align="justify" class="Estilo8">En los a&ntilde;os 1960 se produjeron cambios notorios en varios campos de la inform&aacute;tica,con la aparicion de el circuito cerrado la mayor&iacute;a orientados a seguir incrementando el potencial de los computadores. Para ello se utilizaban t&eacute;cnicas de lo m&aacute;s diversas:</p>
            <h3 align="justify" class="Estilo8">Multiprogramaci&oacute;n</h3>
            <p align="justify" class="Estilo8">En un sistema multiprogramado la memoria principal alberga a m&aacute;s de un programa de usuario. La CPU ejecuta instrucciones de un programa, cuando el que se encuentra en ejecuci&oacute;n realiza una operaci&oacute;n de E/S; en lugar de esperar a que termine la operaci&oacute;n de E/S, se pasa a ejecutar otro programa. Si &eacute;ste realiza, a su vez, otra operaci&oacute;n de E/S, se mandan las &oacute;rdenes oportunas al controlador, y pasa a ejecutarse otro. De esta forma es posible, teniendo almacenado un conjunto adecuado de tareas en cada momento, utilizar de manera &oacute;ptima los recursos disponibles.</p>
            <h3 align="justify" class="Estilo8">Tiempo compartido</h3>
            <p align="justify" class="Estilo8">En este punto tenemos un sistema que hace buen uso de la electr&oacute;nica disponible, pero adolece de falta de interactividad; para conseguirla debe convertirse en un sistema multiusuario, en el cual existen varios usuarios con un terminal en l&iacute;nea, utilizando el modo de operaci&oacute;n de tiempo compartido. En estos sistemas los programas de los distintos usuarios residen en memoria. Al realizar una operaci&oacute;n de E/S los programas ceden la CPU a otro programa, al igual que en la multiprogramaci&oacute;n. Pero, a diferencia de &eacute;sta, cuando un programa lleva cierto tiempo ejecut&aacute;ndose el sistema operativo lo detiene para que se ejecute otro aplicaci&oacute;n.</p>
            <h3 class="Estilo8">Tiempo real</h3>
            <p class="Estilo8">Estos sistemas se usan en entornos donde se deben aceptar y procesar en tiempos muy breves un gran n&uacute;mero de sucesos, en su mayor&iacute;a externos al ordenador. Si el sistema no respeta las restricciones de tiempo en las que las operaciones deben entregar su resultado se dice que ha fallado. El tiempo de respuesta a su vez debe servir para resolver el problema o hecho planteado</p>
            <h3 class="Estilo8">Multiprocesador</h3>
            <p class="Estilo8">Permite trabajar con m&aacute;quinas que poseen m&aacute;s de un microprocesador. En un multiprocesador los procesadores comparten memoria y reloj.</p>
            <h3 class="Estilo8">Sistemas operativos desarrollados</h3>
            <p class="Estilo8">Adem&aacute;s del Atlas Supervisor y el OS/360, los sesenta marcaron el inicio de UNIX, a mediados de los 60 aparece Multics, sistema operativo multiusuario &ndash; multitarea desarrollado por los laboratorios Bell de AT&amp;T y programado en PL/1 uno de los pocos SO desarrollados en un lenguaje de alto nivel en aquel tiempo, luego del fracaso del proyecto UNIX comienza a desarrollarse a partir de este a finales de la d&eacute;cada.</p>
            </div>
          </div></td>
      </tr>
      <tr>
        <td><div align="center">
          <p>&nbsp;</p>
          <p><img src="sistemas operativos a&ntilde;os 60.jpg" width="500" height="350" /></p>
        </div></td>
      </tr>
      <tr>
        <td height="393"><div align="center">
          <p>&nbsp;</p>
          <p class="Estilo14">A&ntilde;os 70 </p>
          <p align="justify" class="Estilo8">Debido al avance de la electr&oacute;nica, pudieron empezar a crearse circuitos con miles de transistores en un cent&iacute;metro cuadrado de silicio, lo que llevar&iacute;a, pocos a&ntilde;os despu&eacute;s, a producirse los primeros sistemas integrados. &Eacute;sta d&eacute;cada se podr&iacute;a definir como la de los sistemas de prop&oacute;sito general y en ella se desarrollan tecnolog&iacute;as que se siguen utilizando en la actualidad. Es en los a&ntilde;os 1970 cuando se produce el boom de los miniordenadores y la inform&aacute;tica se acerca al nivel de usuario.</p>
          <h3 align="justify" class="Estilo8">Inconvenientes de los sistemas existentes</h3>
          <p align="justify" class="Estilo8">Se trataba de sistemas grandes y costosos, pues antes no se hab&iacute;a construido nada similar y muchos de los proyectos desarrollados terminaron con costos muy por encima del presupuesto y mucho despu&eacute;s de lo que se marcaba como fecha de finalizaci&oacute;n. Adem&aacute;s, aunque formaban una capa entre el hardware y el usuario, &eacute;ste deb&iacute;a conocer un complejo lenguaje de control para realizar sus trabajos.&nbsp;</p>
          <h3 align="justify" class="Estilo8">Caracter&iacute;sticas de los nuevos sistemas</h3>
          <p align="justify" class="Estilo8">Para solventar los problemas antes comentados, se realiz&oacute; un costos&iacute;simo trabajo para interponer una amplia capa de software entre el usuario y la m&aacute;quina, de forma que el primero no tuviese que conocer ning&uacute;n detalle de la circuiter&iacute;a.</p>
          <h3 align="justify" class="Estilo8">Sistemas operativos desarrollados</h3>
          <p align="justify" class="Estilo8">* MULTICS (Multiplexed Information and Computing Service): Originalmente era un proyecto cooperativo liderado por Fernando Corbat&oacute; del MIT, con General Electric y los laboratorios Bell, que comenz&oacute; en los 60, pero los laboratorios Bell abandonaron en 1969 para comenzar a crear el sistema UNIX. Se desarroll&oacute; inicialmente para el mainframe GE-645, un sistema de 36 bits; despu&eacute;s fue soportado por la serie de m&aacute;quinas Honeywell 6180</p>
          </div></td>
      </tr>
      <tr>
        <td><div align="center">
          <p>&nbsp;</p>
          <p><img src="sistemas operativos a&ntilde;os 70.jpg" width="500" height="350" /></p>
        </div></td>
      </tr>
      <tr>
        <td><div align="center">
          <p>&nbsp;</p>
          <p class="Estilo14">A&ntilde;os 80 </p>
          <p align="justify" class="Estilo8">Con la creaci&oacute;n de los circuitos LSI -integraci&oacute;n a gran escala-, chips que conten&iacute;an miles de transistores en un cent&iacute;metro cuadrado de silicio, empez&oacute; el auge de los ordenadores personales. En &eacute;stos se dej&oacute; un poco de lado el rendimiento y se busc&oacute; m&aacute;s que el sistema operativo fuera amigable, surgiendo men&uacute;s, e interfaces gr&aacute;ficas. Esto reduc&iacute;a la rapidez de las aplicaciones, pero se volv&iacute;an m&aacute;s pr&aacute;cticos y simples para los usuarios. En esta &eacute;poca, siguieron utiliz&aacute;ndose lenguajes ya existentes, como Smalltalk o C, y nacieron otros nuevos, de los cuales se podr&iacute;an destacar: C++ y Eiffel dentro del paradigma de la orientaci&oacute;n a objetos, y Haskell y Miranda en el campo de la programaci&oacute;n declarativa. Un avance importante que se estableci&oacute; a mediados de la d&eacute;cada de 1980 fue el desarrollo de redes de computadoras personales que corr&iacute;an sistemas operativos en red y sistemas operativos distribuidos</p>
          <h3 align="justify" class="Estilo8">Apple Macintosh</h3>
          <p align="justify" class="Estilo8">El lanzamiento oficial se produjo en enero de 1984, al precio de 2495 d&oacute;lares. Muchos usuarios, al ver que estaba completamente dise&ntilde;ado para funcionar a trav&eacute;s de una GUI (Graphic User Interface), acostumbrados a la l&iacute;nea de comandos, lo tacharon de juguete. A pesar de todo, el Mac se situ&oacute; a la cabeza en el mundo de la edici&oacute;n a nivel gr&aacute;fico.</p>
          <h3 align="justify" class="Estilo8">MS-DOS</h3>
          <p align="justify" class="Estilo8">En 1981 Microsoft compr&oacute; un sistema operativo llamado QDOS que, tras realizar unas pocas modificaciones, se convirti&oacute; en la primera versi&oacute;n de MS-DOS (MicroSoft Disk Operating System). A partir de aqu&iacute; se sucedieron una serie de cambios hasta llegar a la versi&oacute;n 7.1, a partir de la cual MS-DOS dej&oacute; de existir como tal y se convirti&oacute; en una parte integrada del sistema operativo Windows.</p>
          <h3 align="justify" class="Estilo8">Microsoft Windows</h3>
          <p align="justify" class="Estilo8">Familia de sistemas operativos propietarios desarrollados por la empresa de software Microsoft Corporation, fundada por Bill Gates y Paul Allen. Todos ellos tienen en com&uacute;n el estar basados en una interfaz gr&aacute;fica de usuario basada en el paradigma de ventanas, de ah&iacute; su nombre en ingles</p>
          </div></td>
      </tr>
      <tr>
        <td><div align="center">
          <p>&nbsp;</p>
          <p><img src="sistemas operativos a&ntilde;os 80.jpg" width="500" height="350" /></p>
        </div></td>
      </tr>
      <tr>
        <td><div align="center">
          <p>&nbsp;</p>
          <p class="Estilo14">A&ntilde;os 90 </p>
          <h3 align="justify" class="Estilo8">GNU/Linux</h3>
          <p align="justify" class="Estilo8">En 1991 aparece la primer versi&oacute;n del n&uacute;cleo de Linux. Creado por&nbsp;<strong>Linus Torvalds</strong>&nbsp;y un sinf&iacute;n de colaboradores a trav&eacute;s de Internet. Este sistema se basa en Unix, un sistema que en principio trabajaba en modo comandos, estilo MS-DOS. Hoy en d&iacute;a dispone de Ventanas, gracias a un servidor grafico y a gestores de ventanas como KDE, GNOME entre muchos. Recientemente GNU/Linux dispone de un aplicativo que convierte las ventanas en un entorno 3D como por ejemplo Beryl. Lo que permite utilizar linux de una forma muy visual y atractiva.</p>
          </div></td>
      </tr>
      <tr>
        <td><div align="center">
          <p>&nbsp;</p>
          <p><img src="sistemas operativos a&ntilde;os90.jpg" width="500" height="350" /></p>
          <p>&nbsp;</p>
        </div></td>
      </tr>
    </table></td>
  </tr>
  <tr>
    <td bgcolor="#FFCC33"><table width="1364" height="104" border="1">
      <tr>
        <td width="359"><p>Si quieres conocer mas de nosotros entra a nuestras siguientes redes sociales:</p>
          <p align="center"><img src="logo twiter.jpg" alt="7" width="75" height="75" /><img src="logo instagram.jpg" alt="6" width="75" height="75" /><img src="logo facebook.png" alt="5" width="75" height="75" /><img src="logo youtube.png" alt="8" width="80" height="70" /></p></td>
        <td width="797"><p align="center"><strong>Copyright </strong>&copy; 2020-2021 Evolucion de las Computadoras. </p>
          <p align="center">Todos los derechos reservados </p></td>
        <td width="186"><img src="logo pie de pgina.jpg" width="186" height="135" /></td>
      </tr>
    </table>    
    </td>
  </tr>
</table>
<p>&nbsp;</p>
</body>
</html>
