<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Proyecto de Grado</title>
<style type="text/css">
<!--
.Estilo2 {	font-size: 36px;
	color: #FF0000;
}
.Estilo5 {font-size: 36px}
.Estilo6 {font-size: 24px}
body {
	background-color: #FFFFFF;
}
.Estilo7 {font-size: 36px; font-family: Georgia, "Times New Roman", Times, serif; }
.Estilo8 {font-size: 24px; font-family: Georgia, "Times New Roman", Times, serif; }
.Estilo9 {font-family: Georgia, "Times New Roman", Times, serif}
-->
</style>
<script type="text/JavaScript">
<!--
function MM_swapImgRestore() { //v3.0
  var i,x,a=document.MM_sr; for(i=0;a&&i<a.length&&(x=a[i])&&x.oSrc;i++) x.src=x.oSrc;
}

function MM_preloadImages() { //v3.0
  var d=document; if(d.images){ if(!d.MM_p) d.MM_p=new Array();
    var i,j=d.MM_p.length,a=MM_preloadImages.arguments; for(i=0; i<a.length; i++)
    if (a[i].indexOf("#")!=0){ d.MM_p[j]=new Image; d.MM_p[j++].src=a[i];}}
}

function MM_findObj(n, d) { //v4.01
  var p,i,x;  if(!d) d=document; if((p=n.indexOf("?"))>0&&parent.frames.length) {
    d=parent.frames[n.substring(p+1)].document; n=n.substring(0,p);}
  if(!(x=d[n])&&d.all) x=d.all[n]; for (i=0;!x&&i<d.forms.length;i++) x=d.forms[i][n];
  for(i=0;!x&&d.layers&&i<d.layers.length;i++) x=MM_findObj(n,d.layers[i].document);
  if(!x && d.getElementById) x=d.getElementById(n); return x;
}

function MM_swapImage() { //v3.0
  var i,j=0,x,a=MM_swapImage.arguments; document.MM_sr=new Array; for(i=0;i<(a.length-2);i+=3)
   if ((x=MM_findObj(a[i]))!=null){document.MM_sr[j++]=x; if(!x.oSrc) x.oSrc=x.src; x.src=a[i+2];}
}
//-->
</script>
</head>

<body onload="MM_preloadImages('INICIO 2.png','COMPUTADORAS.png','PROCESADOR.png','SISTEMAS O.png','CONTACTOS.png')">
<table width="1338" border="1">
  <tr>
    <td width="1345" bgcolor="#FF9900"><div align="left">
      <table width="100%" border="0">
        <tr>
          <td width="28%" height="268"><img src="logo index.jpg" alt="9" width="483" height="266" /></td>
          <td width="72%"><div align="center" class="Estilo2">
            <table width="99%" border="0">
              <tr>
                <td><div align="center"><img src="BOTON INFORMATICA.png" alt="3" width="862" height="139" /></div></td>
              </tr>
              <tr>
                <td><img src="titulo index.png" alt="10" width="862" height="118" /></td>
              </tr>
            </table>
          </div></td>
        </tr>
      </table>
    </div></td>
  </tr>
  <tr>
    <td height="47"><table width="99%" border="0">
      <tr>
        <td width="17%" height="37"><a href="index proyecto de grado.html" onmouseout="MM_swapImgRestore()" onmouseover="MM_swapImage('inicio','','INICIO 2.png',1)"><img src="BOTON INICIO.png" name="inicio" width="222" height="54" border="0" id="inicio" /></a></td>
        <td width="22%"><a href="evolucion de las computadoras.html" onmouseout="MM_swapImgRestore()" onmouseover="MM_swapImage('computadoras','','COMPUTADORAS.png',1)"><img src="BOTON COMPUTADORAS.png" name="computadoras" width="303" height="54" border="0" id="computadoras" /></a></td>
        <td width="19%"><a href="#" onmouseout="MM_swapImgRestore()" onmouseover="MM_swapImage('procesador','','PROCESADOR.png',1)"><img src="BOTON PROCESADOR.png" name="procesador" width="276" height="54" border="0" id="procesador" /></a></td>
        <td width="20%"><a href="evolucion sistemas operativos.html" onmouseout="MM_swapImgRestore()" onmouseover="MM_swapImage('sistemas o','','SISTEMAS O.png',1)"><img src="BOTON SISTEMAS O.png" name="sistemas o" width="288" height="54" border="0" id="sistemas o" /></a></td>
        <td width="22%"><a href="pagina de contactos.html" onmouseout="MM_swapImgRestore()" onmouseover="MM_swapImage('contactos','','CONTACTOS.png',1)"><img src="BOTON CONTACTOS.png" name="contactos" width="254" height="54" border="0" id="contactos" /></a></td>
      </tr>
    </table></td>
  </tr>
  <tr>
    <td><table width="1359" height="1982" border=0" cellspacing="15">
      <tr>
        <td colspan="4" bgcolor="#FFFFFF"><div align="center" class="Estilo5">
          <p class="Estilo9">Inicios del Procesador </p>
          <p class="Estilo8">(1971-1989)</p>
          <p class="Estilo6">&nbsp;</p>
        </div></td>
        </tr>
      <tr>
        <td width="313" height="121" bgcolor="#FFFFFF"><div align="center"><strong>1971: El Intel 4004 </strong></div>
          <p align="justify">El 4004 fue el primer microprocesador del mundo, creado en un simple chip y desarrollado por Intel. Era un CPU de 4 bits y tambi&eacute;n fue el primero disponible comercialmente. Este desarrollo impuls&oacute; la calculadora de Busicom e inici&oacute; el camino para dotar de &laquo;inteligencia&raquo; a objetos inanimados y asimismo, a la computadora personal.</p>
          <p align="center"><img src="Intel_4004.jpg" width="180" height="130" /></p></td>
        <td width="326" bgcolor="#FFFFFF"><div align="center"><strong>1972: El Intel 8008 </strong></div>
          <p align="justify">Codificado inicialmente como 1201, fue pedido a Intel por Computer Terminal Corporation para usarlo en su terminal programable Datapoint 2200, pero debido a que Intel termin&oacute; el proyecto tarde y a que no cumpl&iacute;a con las expectativas de Computer Terminal Corporation, finalmente no fue usado en el Datapoint. .</p>
          <p align="center"><img src="intel 8008.jpg" width="180" height="130" /></p></td>
        <td width="311" bgcolor="#FFFFFF"><div align="center"><strong>1974: El Intel 8080 </strong></div>
          <div align="justify">EL 8080 se convirti&oacute; en la&nbsp;CPU&nbsp;de la primera computadora personal, la&nbsp;Altair 8800&nbsp;de MITS, seg&uacute;n se alega, nombrada as&iacute; por un destino de la Nave Espacial &laquo;Starship&raquo; del programa de televisi&oacute;n Viaje a las Estrellas, y el&nbsp;IMSAI 8080, formando la base para las m&aacute;quinas que ejecutaban el sistema operativo&nbsp;CP/M-80. Los fan&aacute;ticos de las computadoras pod&iacute;an comprar un equipo Altair por un precio (en aquel momento) de 395&nbsp;USD. </div>
          <p align="center"><img src="intel 8080.jpg" width="180" height="130" /></p></td>
        <td width="326" bgcolor="#FFFFFF"><div align="center"><strong>1982: El Intel 80286</strong></div>
          <p align="justify">El 80286, popularmente conocido como 286, fue el primer procesador de Intel que podr&iacute;a ejecutar todo el software escrito para su predecesor. Esta compatibilidad del software sigue siendo un sello de la familia de microprocesadores de Intel. Luego de seis a&ntilde;os de su introducci&oacute;n, hab&iacute;a un estimado de 15 millones de PC basadas en el 286, instaladas alrededor del mundo.</p>
          <p align="center"><img src="intel 80286.jpg" width="180" height="130" /></p></td>
      </tr>
      <tr>
        <td height="362" bgcolor="#FFFFFF"><div align="center"><strong>1985: El Intel 80386 </strong></div>
          <p align="justify">Este procesador Intel, popularmente llamado 386, se integr&oacute; con 275&nbsp;000 transistores, m&aacute;s de 100 veces tantos como en el original 4004. El 386 a&ntilde;adi&oacute; una arquitectura de 32 bits, con capacidad para&nbsp;multitarea&nbsp;y una unidad de traslaci&oacute;n de p&aacute;ginas, lo que hizo mucho m&aacute;s sencillo implementar&nbsp;sistemas operativos&nbsp;que usaran&nbsp;memoria virtual.</p>
          <p align="center"><img src="intel 80386.jpg" width="180" height="130" /></p></td>
        <td bgcolor="#FFFFFF"><div align="center"><strong>1985: El VAX 78032</strong></div>
          <p align="justify">El microprocesador VAX 78032 (tambi&eacute;n conocido como DC333), es de &uacute;nico chip y de 32 bits, y fue desarrollado y fabricado por&nbsp;Digital Equipment Corporation&nbsp;(DEC); instalado en los equipos MicroVAX II, en conjunto con su chip coprocesador de coma flotante separado, el 78132, ten&iacute;an una potencia cercana al 90&nbsp;% de la que pod&iacute;a entregar el&nbsp;minicomputador&nbsp;VAX 11/780&nbsp;que fuera presentado en 1977. </p>
          <p align="center"><img src="El VAX 78032.jpg" width="180" height="130" /></p></td>
        <td bgcolor="#FFFFFF"><div align="center"><strong>1989: El Intel 80486 </strong></div>
          <p align="justify">La generaci&oacute;n 486 realmente signific&oacute; contar con una computadora personal de prestaciones avanzadas, entre ellas, un&nbsp;conjunto de instrucciones&nbsp;optimizado, una&nbsp;unidad de coma flotante&nbsp;o FPU, una unidad de interfaz de bus mejorada y una memoria&nbsp;cach&eacute;&nbsp;unificada, todo ello integrado en el propio chip del microprocesador. Estas mejoras hicieron que los i486 fueran el doble de r&aacute;pidos que el par i386-i387 operando a la misma&nbsp;frecuencia de reloj. . </p>
          <p align="center"><img src="INTEL 80486.jpg" width="180" height="130" /></p></td>
        <td bgcolor="#FFFFFF"><div align="center"><strong>1991: El AMD AMx86</strong></div>
          <p align="justify">Procesadores fabricados por&nbsp;AMD&nbsp;100&nbsp;% compatible con los c&oacute;digos de Intel de ese momento. Llamados &laquo;clones&raquo; de Intel, llegaron incluso a superar la frecuencia de reloj de los procesadores de Intel y a precios significativamente menores. Aqu&iacute; se incluyen las series&nbsp;Am286,&nbsp;Am386,&nbsp;Am486&nbsp;y&nbsp;Am586.</p>
          <p align="center"><img src="EL AMD amx86.jpg" width="180" height="130" /></p></td>
      </tr>
      <tr>
        <td colspan="4"><div align="center">
          <p class="Estilo7">&nbsp;</p>
          <p class="Estilo7">El nacimiento de los Intel Pentium </p>
          <p class="Estilo8">(1993-2000)</p>
          <p class="Estilo8">&nbsp;</p>
        </div></td>
        </tr>
      <tr>
        <td><div align="center"><strong>1993: El Intel Pentium </strong></div>
          <p align="justify">El microprocesador de Pentium pose&iacute;a una arquitectura capaz de ejecutar dos operaciones a la vez, gracias a sus dos tuber&iacute;as de datos de 32 bits cada uno, uno equivalente al 486DX(u) y el otro equivalente a 486SX(u). Adem&aacute;s, estaba dotado de un bus de datos de 64 bits, y permit&iacute;a un acceso a memoria de 64 bits (aunque el procesador segu&iacute;a manteniendo compatibilidad de 32 bits para las operaciones internas, y los registros tambi&eacute;n eran de 32 bits)</p>
          <p align="center"><img src="intel pentium.jpg" width="180" height="130" /></p></td>
        <td><div align="center"><strong>1995: EL Intel Pentium Pro </strong>
        </div>
          <p align="justify">Lanzado al mercado en oto&ntilde;o de 1995, el procesador Pentium Pro (profesional) se dise&ntilde;&oacute; con una arquitectura de&nbsp;32 bits. Se us&oacute; en servidores y los programas y aplicaciones para estaciones de trabajo (de redes) impulsaron r&aacute;pidamente su integraci&oacute;n en las computadoras. El rendimiento del c&oacute;digo de 32 bits era excelente, pero el Pentium Pro a menudo era m&aacute;s lento que un Pentium cuando ejecutaba c&oacute;digo o sistemas operativos de 16 bits.</p>
          <p align="center"><strong><img src="intel pentium pro.jpg" width="180" height="130" /></strong></p></td>
        <td><div align="center"><strong>1997: El Intel Pentium II </strong>
        </div>
          <p align="justify">Un procesador de 7'5 millones de transistores, se busca entre los cambios fundamentales con respecto a su predecesor, mejorar el rendimiento en la ejecuci&oacute;n de c&oacute;digo de&nbsp;16 bits, a&ntilde;adir el conjunto de instrucciones&nbsp;MMX&nbsp;y eliminar la memoria cach&eacute; de segundo nivel del n&uacute;cleo del procesador, coloc&aacute;ndola en una tarjeta de&nbsp;circuito impreso&nbsp;junto a este.</p>
          <p align="center"><img src="INTEL PENTIUM II.jpg" width="180" height="130" /></p></td>
        <td><ul>
          <li><strong>1998: El Intel Pentium II Xeon </strong></li>
        </ul>
          <p align="justify">Los procesadores Pentium II Xeon se dise&ntilde;an para cumplir con los requisitos de rendimiento en computadoras de medio-rango, servidores m&aacute;s potentes y estaciones de trabajo (workstations). Consistente con la estrategia de Intel para dise&ntilde;ar productos de procesadores con el objetivo de llenar segmentos de los mercados espec&iacute;ficos, el procesador Pentium II Xeon ofrece innovaciones t&eacute;cnicas dise&ntilde;adas para las&nbsp;estaciones de trabajo&nbsp;y servidores que utilizan aplicaciones comerciales exigentes</p>
          <p align="center"><img src="intel pentium II Xeon.jpg" width="180" height="130" /></p></td>
      </tr>
      <tr>
        <td height="232"><div align="center"><strong>1999: El Intel Celeron </strong></div>
          <p align="justify">Continuando la estrategia, Intel, en el desarrollo de procesadores para el segmento de mercados espec&iacute;ficos, el procesador Celeron es el nombre que lleva la l&iacute;nea de bajo costo de Intel. El objetivo fue poder, mediante esta segunda marca, penetrar en los mercados impedidos a los Pentium, de mayor rendimiento y precio. Se dise&ntilde;a para a&ntilde;adir valor al segmento del mercado de los PC. Proporcion&oacute; a los consumidores una gran actuaci&oacute;n a un bajo coste, y entreg&oacute; un rendimiento destacado para usos como juegos y el software educativo.</p>
          <p align="center"><img src="intel celeron.jpg" width="180" height="130" /></p></td>
        <td><div align="center"><strong>1999: El Intel Pentium III </strong></div>
          <p align="justify">El procesador Pentium III ofrece 70 nuevas instrucciones Internet Streaming, las extensiones de&nbsp;SIMD&nbsp;que refuerzan dram&aacute;ticamente el rendimiento con im&aacute;genes avanzadas, 3D, a&ntilde;adiendo una mejor calidad de audio, video y rendimiento en aplicaciones de reconocimiento de voz. Fue dise&ntilde;ado para reforzar el &aacute;rea del rendimiento en el Internet, le permite a los usuarios hacer cosas, tales como, navegar a trav&eacute;s de p&aacute;ginas pesadas</p>
          <p align="center"><img src="INTEL PENTIUM III.jpg" width="180" height="130" /></p></td>
        <td><ul>
          <li><strong>1999: El Intel Pentium III Xeon </strong></li>
        </ul>
          <p align="justify">El procesador Pentium III Xeon ampl&iacute;a las fortalezas de Intel en cuanto a las estaciones de trabajo (workstation) y segmentos de mercado de servidores, y a&ntilde;ade una actuaci&oacute;n mejorada en las aplicaciones del comercio electr&oacute;nico e inform&aacute;tica comercial avanzada. Los procesadores incorporan mejoras que refuerzan el procesamiento&nbsp;multimedia, particularmente las aplicaciones de v&iacute;deo. </p>
          <p align="center"><img src="INTEL PENTIUN III XEON.jpeg" width="180" height="130" /></p></td>
        <td><div align="center"><strong>2000: EL Intel Pentium 4 </strong></div>
          <p align="justify">Este es un microprocesador de s&eacute;ptima generaci&oacute;n basado en la&nbsp;arquitectura x86&nbsp;y fabricado por&nbsp;Intel. Es el primero con un dise&ntilde;o completamente nuevo desde el&nbsp;Pentium Pro. Se estren&oacute; la arquitectura NetBurst, la cual no daba mejoras considerables respecto a la anterior P6. Intel sacrific&oacute; el rendimiento de cada ciclo para obtener a cambio mayor cantidad de ciclos por segundo y una mejora en las instrucciones&nbsp;SSE.</p>
          <p align="center"><img src="INTEL PENTIUM 4.jpg" width="180" height="130" /></p></td>
      </tr>
      <tr>
        <td colspan="4"><p align="center" class="Estilo5">&nbsp;</p>
          <p align="center" class="Estilo7">La ultima evolucion de procesadores hasta la actualidad</p>
          <p align="center" class="Estilo8">(2001-2021) </p>
          <p align="center" class="Estilo6">&nbsp;</p></td>
        </tr>
      <tr>
        <td height="109"><div align="center"><strong>2001: El AMD Athlon XP </strong></div>
          <p align="justify">Cuando Intel sac&oacute; el&nbsp;Pentium 4&nbsp;a 1,7&nbsp;GHz en abril de 2001 se vio que el Athlon Thunderbird no estaba a su nivel. Adem&aacute;s no era pr&aacute;ctico para el overclocking, entonces para seguir estando a la cabeza en cuanto a rendimiento de los procesadores x86, AMD tuvo que dise&ntilde;ar un nuevo n&uacute;cleo, y sac&oacute; el&nbsp;Athlon XP. Este compatibilizaba las instrucciones&nbsp;SSE&nbsp;y las 3DNow</p>
          <p align="center"><img src="AMD ATHLON XP.jpg" width="180" height="130" />! </p></td>
        <td><div align="center"><strong>2004: El AMD Athlon 64 </strong>
        </div>
          <p align="justify">El AMD Athlon 64 es un microprocesador x86 de octava generaci&oacute;n que implementa el conjunto de instrucciones&nbsp;AMD64, que fueron introducidas con el procesador Opteron. El Athlon 64 presenta un controlador de memoria en el propio circuito integrado del microprocesador y otras mejoras de arquitectura que le dan un mejor rendimiento que los anteriores Athlon y que el Athlon XP funcionando a la misma velocidad, incluso ejecutando c&oacute;digo heredado de 32 bits</p>
          <p align="center"><img src="EL AMD_Athlon_64.jpg" width="180" height="130" /></p></td>
        <td><div align="center"><strong>2006: El Intel Core Duo </strong>
        </div>
          <p align="justify">Intel lanz&oacute; esta gama de procesadores de doble n&uacute;cleo y CPUs 2x2 MCM (m&oacute;dulo Multi-Chip) de cuatro n&uacute;cleos con el conjunto de instrucciones x86-64, basado en la nueva arquitectura Core de Intel. La&nbsp;microarquitectura&nbsp;Core regres&oacute; a velocidades de CPU bajas y mejor&oacute; el uso del procesador de ambos ciclos de velocidad y energ&iacute;a comparados con anteriores NetBurst de los CPU Pentium 4/D2</p>
          <p align="center"><img src="INTEL CORE DUO.jpg" width="180" height="130" /></p></td>
        <td><div align="center"><strong>2011: El AMD Fusion </strong>
        </div>
          <p align="justify">AMD Fusion&nbsp;es el nombre clave para los microprocesadores Turion, producto de la fusi&oacute;n entre&nbsp;AMD&nbsp;y&nbsp;ATI, se combinan el proceso de la geometr&iacute;a 3D y otras funciones de GPUs actuales. La&nbsp;GPU&nbsp;est&aacute; integrada en el propio microprocesador. Los primeros modelos salieron entre los &uacute;ltimos meses de 2010 y primeros de 2011 denominados Ontaro y Zacate (bajo consumo), Llano, Brazos y Bulldozer (gamas media y alta) salieron entre mediados y finales del 2011.</p>
          <p align="center"><img src="EL AMD FUSION.jpg" width="180" height="130" /></p></td>
      </tr>
      <tr>
        <td height="234"><div align="center"><strong>2012: El Intel Core Ivy Bridge </strong>
        </div>
          <p align="justify">Ivy Bridge es el nombre en clave de los procesadores conocidos como Intel Core de tercera generaci&oacute;n. Son por tanto sucesores de los micros que aparecieron a principios de 2011, cuyo nombre en clave es Sandy Bridge. Pasamos de los 32 nan&oacute;metros de ancho de transistor en Sandy Bridge a los 22 de Ivy Bridge. Esto le permite meter el doble de ellos en la misma &aacute;rea. Un mayor n&uacute;mero de transistores significa que puedes poner m&aacute;s bloques funcionales dentro del chip</p>
          <p align="center"><img src="INTEL IVY BRIDGE.jpg" width="180" height="130" /></p></td>
        <td><div align="center"><strong>2013: El Intel Core Haswell </strong>
        </div>
          <p align="justify">Haswell es el nombre clave de los procesadores de cuarta generaci&oacute;n de Intel Core. Son la correcci&oacute;n de errores de la tercera generaci&oacute;n e implementan nuevas tecnolog&iacute;as gr&aacute;ficas para el gamming y el dise&ntilde;o gr&aacute;fico, funcionando con un menor consumo y teniendo un mejor rendimiento a un buen precio. Continua como su predecesor en 22 nan&oacute;metros pero funciona con un nuevo socket con clave 1150. </p>
          <p align="center"><img src="INTEL CORE HASWEL.jpg" width="180" height="130" /></p></td>
        <td><div align="center"><strong>2017: El Intel Core i7-7920HQ</strong>
        </div>
          <p align="justify">Este procesador est&aacute; en la l&iacute;nea de la s&eacute;ptima generaci&oacute;n, incorporando una potencia y una capacidad de respuesta nunca antes vistas. Especialmente fabricado para usuarios exigentes que quieren aumentar su productividad, sin dejar de lado a aquellos que pretenden pensar tambi&eacute;n en el entretenimiento y juegos sensacionales, con alta transferencia de datos y mucho m&aacute;s, ya est&aacute; disponible en el mercado.</p>
          <p align="center"><img src="INTEL CORE I7.jpg" width="180" height="130" /></p></td>
        <td><div align="center"><strong>2021: Intel Core de 11&ordf; Generaci&oacute;n</strong>
        </div>
          <p align="justify">Estos procesadores cuentan con los nuevos transistores SuperFin, combinan nuevas tecnolog&iacute;as como&nbsp;WiFi&nbsp;6,&nbsp;Thunderbolt&nbsp;4, decodificaci&oacute;n de medios&nbsp;AV1, interfaz&nbsp;PCI Express&nbsp;Gen 4 anexada al procesador y caracter&iacute;sticas de seguridad reforzadas por hardware. Admite velocidades de hasta 4.8 Ghz e Intel Optane H10 con almacenamiento en estado s&oacute;lido para las unidades m&aacute;s veloces. </p>
          <p align="center"><img src="intel de 11&deg; genercion.png" width="180" height="130" /></p></td>
      </tr>
      
    </table></td>
  </tr>
  <tr>
    <td bgcolor="#FFCC33"><table width="1362" height="104" border="1">
      <tr>
        <td width="354"><p>Si quieres conocer mas de nosotros entra a nuestras siguientes redes sociales:</p>
          <p align="center"><img src="logo twiter.jpg" alt="7" width="75" height="75" /><img src="logo instagram.jpg" alt="6" width="75" height="75" /><img src="logo facebook.png" alt="5" width="75" height="75" /><img src="logo youtube.png" alt="8" width="80" height="70" /></p></td>
        <td width="804"><p align="center"><strong>Copyright </strong>&copy; 2020-2021 Evolucion de las Computadoras. </p>
          <p align="center">Todos los derechos reservados </p></td>
        <td width="175"><img src="logo pie de pgina.jpg" width="177" height="137" /></td>
      </tr>
    </table>    </td>
  </tr>
</table>
<p>&nbsp;</p>
</body>
</html>
